; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-4-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s1)
	(at driver4 s2)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s2)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s0)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s0)
	(at package2 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 81)
	(= (time-to-drive s1 s0) 81)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 37)
	(= (time-to-drive s2 s0) 37)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 18)
	(= (time-to-drive s2 s1) 18)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s0)
	(at driver4 s1)
	(at truck1 s0)
	(at truck2 s1)
	(at truck3 s0)
	(at truck4 s2)
	(at package1 s0)
	(at package2 s0)
	))

(:metric minimize (+ (* 3 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver2 s2 p0-2)
   deleted: (at driver2 s2)
   added: (at driver2 p0-2)
   goals met: 4 of 10
2. (walk driver2 p0-2 s0)
   deleted: (at driver2 p0-2)
   added: (at driver2 s0)
   goals met: 5 of 10
3. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   goals met: 5 of 10
4. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   goals met: 6 of 10
5. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 5 of 10
6. (drive-truck truck4 s1 s2 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   changed: (fuel-used) from 0 to 180
   goals met: 6 of 10
7. (walk driver4 s2 p2-1)
   deleted: (at driver4 s2)
   added: (at driver4 p2-1)
   goals met: 6 of 10
8. (walk driver4 p2-1 s1)
   deleted: (at driver4 p2-1)
   added: (at driver4 s1)
   goals met: 7 of 10
9. (disembark-truck driver1 truck4 s2)
   deleted: (driving driver1 truck4)
   added: (at driver1 s2) (empty truck4)
   goals met: 7 of 10
10. (board-truck driver4 truck1 s1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 6 of 10
11. (drive-truck truck1 s1 s0 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 180 to 990
   goals met: 7 of 10
12. (walk driver1 s2 p2-1)
   deleted: (at driver1 s2)
   added: (at driver1 p2-1)
   goals met: 7 of 10
13. (walk driver1 p2-1 s1)
   deleted: (at driver1 p2-1)
   added: (at driver1 s1)
   goals met: 8 of 10
14. (drive-truck truck1 s0 s2 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 990 to 1360
   goals met: 7 of 10
15. (disembark-truck driver4 truck1 s2)
   deleted: (driving driver4 truck1)
   added: (at driver4 s2) (empty truck1)
   goals met: 7 of 10
16. (board-truck driver4 truck2 s2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 7 of 10
17. (drive-truck truck2 s2 s1 driver4)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (fuel-used) from 1360 to 1540
   goals met: 8 of 10
18. (disembark-truck driver4 truck2 s1)
   deleted: (driving driver4 truck2)
   added: (at driver4 s1) (empty truck2)
   goals met: 9 of 10
19. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   goals met: 8 of 10
20. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   goals met: 8 of 10
21. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 8 of 10
22. (drive-truck truck1 s2 s0 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (fuel-used) from 1540 to 1910
   goals met: 9 of 10
23. (disembark-truck driver2 truck1 s0)
   deleted: (driving driver2 truck1)
   added: (at driver2 s0) (empty truck1)
   goals met: 10 of 10
